/*Создать класс "Матрица". Класс должен иметь следующие поля:
1) двумерный массив вещественных чисел;
2) количество строк и столбцов в матрице.

Класс должен иметь следующие методы:
1) сложение с другой матрицей;
2) умножение на число;
3) вывод на печать;
4) умножение матриц - по желанию.*/

/*package com.uits.task9;

public class MainMatrix {
    public static void main(String[] args) {
        // Тестирование первого конструктора
        System.out.println("Создаем обьект matrix1");
        Matrix matrix1 = new Matrix(4,5); // создание объекта
        System.out.println("Создаем обьект matrix2");
        Matrix matrix2 = new Matrix(6,3);

        // Тестирование второго конструктора
        int p = RandomInt(10);
        int q = RandomInt(10);
        System.out.println("Размер массива: " + p + " на " + q);
        double[][] ar = new double[p][q]; // создаем двумерный массив случайного размера
        System.out.println("Создаем обьект matrix3");
        Matrix matrix3 = new Matrix(ar);      // создание объекта

        System.out.print("matrix1: ");
        Matrix.printMatrix(matrix1.getMatrix());                      // печать матрицы

    }

<<<<<<< HEAD
}*/
/*
=======
    static int RandomInt(int i){
        return 1+(int)(Math.random() * i);
    }
}
>>>>>>> 6f67c0f93afd03d97aa8c558df35a5d4b262eba4
        */